{
  "nasa22": {
    "job_title": "SCaN Intern", 
    "job_org": "National Aeronautics and Space Administration",
    "job_loc" : "John H. Glenn Research Center at Lewis Field, OH", 
    "job_date": "Summer 2022",
    "abstract": "I was re-hired back at NASA as part of the Space Communications and Navigation (SCaN) program to expand the algorithmic theory necessary to have e>ective satellite communications in space environments. My research focused on incorporating additional geometric assumptions into routing models built for of delay- and disruption-tolerant networks, particularly in the low Earth orbit regime.",
    "expandables": {},
    "materials_list" : "",
    "other": "",
    "background_image": "/resources/nasa_logo.png",
    "tags": ["Space networking", "Graph Theory", "Flow algorithms"]
  },
  "orau18": {
    "job_title": "Research Associate", 
    "job_org": "Oak Ridge Institute for Science and Education",
    "job_loc" : "Air Force Research Laboratory, WPAFB", 
    "job_date": "Fall 2017, Fall 2018 - Fall 2019",
    "abstract": "As I read more into theoretical foundations of density-based clustering, my research began to intersect Topology Theory and Manifold Learning. In 2017, I began to research these connections in a minor capacity with a local research group studying the intersection of TDA and machine learning. The research primarily involved understanding the basic foundations of Topology towards extending the Mapper framework, a popular and very general method which has been used successfully for data analysis. \n \n Starting Fall 2018 I was hired full-time to begin enhancing/extending Mapper, and to assist the team in using Mapper on real-world applications. My primary research towards this end has been two-fold: (1) to enable efficient construction of mappers in a multiscale setting, (2) understand the full range of use-cases for the Mapper framework. For more details, see below.",
    "expandables": {
      "publications": ["testing"]
    },
    "materials_list" : "",
    "other": "",
    "background_image": "/resources/orise.png",
    "tags": ["Topology", "Mapper", "R package"]
  },
  "nasa18": {
    "job_title": "LERCIP Intern", 
    "job_org": "National Aeronautics and Space Administration",
    "job_loc" : "John H. Glenn Research Center at Lewis Field, OH", 
    "job_date": "Summer 2018",
    "abstract": "I was hired by Dr. Steven Arnold under NASAs 10-week LERCIP program to apply Machine Learning to a specific Material Science problem. The first phase of the research project involving training a fairly trivial feed-forward Artificial Neural Network (ANN) to act a surrogate model for the Generalized Method of Cells (GMC) technique. The second (non-trivial) phase of the project involved creating a systematic procedure for interpreting various aspects of the data produced by the surrogate model using a non-parameteric Optimal Experimental Design (OED)-motivated optimization procedure, recently made possible by the Approximate Coordinate Exchange algorithm.",  
    "expandables": {},
    "materials_list" : "",
    "other": "",
    "background_image": "/resources/nasa_logo.png",
    "tags": ["Experimental design", "Machine learning", "Material science"]
  }, 
  "gsoc17":{
    "job_title": "Student Participant", 
    "job_org": "Google Summer of Code",
    "job_loc" : "R Project for Statistical Computing", 
    "job_date": "Summer 2017",
    "abstract": "I submitted a successful funding proposal under the Google Summer of Code (GSOC) Initiative to the R Project for Statistical Computing to explore, develop, and unify recent developments related the theory of density-based clustering. This involved a mixture of code development which culminated in the form of an R package, as well as deep research to further understand the theory and utility of the cluster tree. There was also a WSU newsroom piece that describes the proposal in a non-technical way.",
    "materials_list" : [
        "https://summerofcode.withgoogle.com/archive/2017/projects/5919718795902976"
    ],
    "expandables": {
      "software": ["https://summerofcode.withgoogle.com/archive/2017/projects/5919718795902976"]
    },
    "background_image": "/resources/gsoc.png",
    "tags": ["Clustering", "Learning theory", "R package"]
  },
  "afit13":{
    "job_title": "Civilian Research Assistant", 
    "job_org": "Southwestern Ohio Council For Higher Education",
    "job_loc" : "Air Force Institute of Technology, WPAFB", 
    "job_date": "December 2013 - June 2014",
    "abstract": "I was hired at the Air Force Institute of Technology (AFIT) as an undergraduate student to do research in a multi-disciplinary team called the Low Orbitals Radar and Electromagnetism group, where I worked on a diverse set of projects involving computational, statistical, or physics-based requirements. Being my first research-oriented experience, I either assisted graduate students with primarily programmatic or educational tasks or worked on very computationally-oriented tasks.",
    "expandables": {
      "Example projects": ["Implementing an unsplittable flow approximation algorithm in C++ and Python", "Creating a conversion tool between Oracle's Abstract Data Type and XMLType", "A prototypical UI to to enhance searching and viewing of 2-or-3D models using JavaScript"]
    },
    "background_image": "/resources/soche.png",
    "tags": ["Optimization", "Graph theory", "Flow algorithms"]
  }
}