{
  "aar": {
    "title": "Towards Autonomous Aerial Refueling: Massive Parallel Iterative Closest Point",
    "abstract": "The Iterative Closest Point (ICP) problem is now a well-studied problem that seeks to align a given query point cloud to a fixed reference point cloud. The ICP problem computationally is dominated by the first phase, a pairwise distance minimization. The 'brute-force' approach, an embarrassingly parallel problem amenable to GPU-acceleration, involves calculating the pairwise distance from every point in the query set to every point in the reference set. This however still requires linear runtime complexity per thread, rendering the trivial solution unsuitable for e.g. real-time applications. Alternative spatial indexing data structures utilizing branch-and-bound (B&B) properties have been proposed as a means of reducing the algorithmic complexity of the ICP problem, however they were originally developed for serial applications: it is well known that direct conversion to their parallel equivalents often results in slower runtime performance than GPU-employed brute-force approaches due to frequent suboptimal memory access patterns and conditional computations. In this application-motivated effort, we propose a novel two-step method which exposes the intrinsic parallelism of the ICP problem, yet retains a number of the B&B properties. Our solution involves an O(log n) approximate search, followed by fast vectorized search we call the Delaunay Traversal, which we show empirically finishes in O(k) time on average, where k << n, and is demonstrated to generally exhibit extremely small growth factors on average. We demonstrate the superiority of our method compared to the traditional B&B and brute-force implementations using a variety of benchmark data sets, and demonstrate its usefulness in the context of Autonomous Aerial Refueling",
    "image": "/resources/icp.png",
    "expandables": {
      "publications": [
        "J. Robinson, M. Piekenbrock, L. Burchett, et. al. Parallelized Iterative Closest Point for Autonomous Aerial Refueling. In International Symposium on Visual Computing (pp. 593-602). Springer International Publishing. (2016, December)", 
        "Piekenbrock, M., Robinson, J., Burchett, L., Nykl, S., Woolley, B., & Terzuoli, A. (2016, July). Automated aerial refueling: Parallelized 3D iterative closest point: Subject area: Guidance and control. In Aerospace and Electronics Conference (NAECON) and Ohio Innovation Summit (OIS), 2016 IEEE National (pp. 188-192). IEEE."
      ]
    }
  }, 
  "dbscan": {
    "title": "Bringing High Performance Density-based Clustering to R",
    "abstract": "Density-based clustering techniques have become extremely popular in the past decade. It's often conjectured that the reason for the success of these methods is due to their ability of identify 'natural groups' in data. These groups are often non-convex (in terms of shape), deviating the typical premise of 'minimal variance' that underlies parametric, model-based approaches, and often appear in very large data sets. As the era of 'Big Data' continues to rise in popularity, it seems that typical notions having access to scalable, easy-to-use, and scalable implementations of these density-based methods is paramount. In this research effort, we provide fast, state-of-the-art density-based algorithms in the form of an open-source package in R. We also provide several related density-based clustering tools to help bring make state of the art density-based clustering accessible to people with large, computationally difficult problems.", 
    "image": "/resources/hdbscan_pts.gif",
    "expandables": {
      "publications": [
        "Hahsler, Michael, Matthew Piekenbrock, and Derek Doran. 'dbscan: Fast Density Based Clustering in R', Journal of Statistical Software, 2018."
      ], 
      "code": {
        "dbscan": {
          "pkg_title": "dbscan", 
          "pkg_type": "R Package",
          "pkg_repo": "https://github.com/mhahsler/dbscan",
          "pkg_link": "https://github.com/mhahsler/dbscan",
          "badges": [
            "badge.svg"
          ]
        }, 
        "clustertree": {
          "pkg_title": "dbscan", 
          "pkg_type": "R Package", 
          "pkg_repo": "https://github.com/mhahsler/dbscan"
        }
      }
    }
  }

}